src/upload/RequestRegistrarPagoIFX_WS2vias.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
	<soapenv:Header/>
	<soapenv:Body>
		<tem:RegistrarPagoIFX >
			<!--Optional:-->
			<tem:infoPago>
				<![CDATA[<?xml version="1.0" encoding="UTF-8"?>
				<IFX>
					<SignonRq>
						<ClientDt>0000-00-00T00:00:00</ClientDt>
						<CustLangPref>es-CO</CustLangPref>
						<ClientApp>
							<Org>Bancolombia</Org>
							<Name>RIN</Name>
							<Version>1.0</Version>
						</ClientApp>
					</SignonRq>
					<PaySvcRq>
						<RqUID>00000000-0000-0000-0000-000000000000</RqUID>
						<MsgRqHdr>
							<NetworkTrnInfo>
								<NetworkOwner>SAI</NetworkOwner>
								<BankId>0007</BankId>
							</NetworkTrnInfo>
							<PointOfServiceData>
								<Environment/>
								<POSAgent>
									<AgentId></AgentId>
								</POSAgent>
								<POSLocation>917</POSLocation>
							</PointOfServiceData>
						</MsgRqHdr>
						<SPName>0000</SPName>
						<PmtAddRq>
							<RqUID>00000000-0000-0000-0000-000000000000</RqUID>
							<PmtInfo>
								<CurAmt>
									<Amt>0.00</Amt>
									<CurCode>E</CurCode>
								</CurAmt>
								<RemitInfo>
									<CustPayeeId>0</CustPayeeId>
									<BillId>00000000-0000-0000-0000-000000000000</BillId>
									<PmtId>00000000000810</PmtId>
									<CurAmt>
										<Amt>0.00</Amt>
									</CurAmt>
								</RemitInfo>
								<DepAcctIdFrom>
									<AcctId/>
									<AcctType>Default</AcctType>
									<BankInfo/>
								</DepAcctIdFrom>
								<PrcDt>0000-00-00</PrcDt>
							</PmtInfo>
						</PmtAddRq>
					</PaySvcRq>
				</IFX>
	]]>
			</tem:infoPago>
		</tem:RegistrarPagoIFX>
	</soapenv:Body>
</soapenv:Envelope>